{
  "education": [
    {
      "awards_achievements": [
        "First Class Honors",
        "GPA: 4.51/5.0"
      ],
      "degree": "Bachelor of Engineering",
      "department": "Petroleum Engineering",
      "duration": "2014-2019",
      "school_name": "Covenant University"
    },
    {
      "awards_achievements": [
        "Deans List (2021, 2022): Obtained a cumulative average of 80% or higher",
        "GPA: 3.53/4.0"
      ],
      "degree": "Post Graduate Certificate",
      "department": "Information Technology Solutions",
      "duration": "2021-2022",
      "school_name": "Humber College"
    }
  ],
  "github_repo_root_url": "https://github.com/Jarvis-Consulting-Group/jarvis_data_eng-OreoluwaLawal",
  "highlighted_projects": [
    {
      "description": "Developed an application by which users can send some currency from one wallet to another via a frontend interface. Utilized BlockCypher API for payment processing, wallet details and querying the blockchain for pending transactions. Applied Sass and Bootstrap to make the application responsive. The application was tested with Testnet Bitcoin.",
      "git_url": "https://github.com/Oreoluwatemi/Bitcoin-Testnet-Transactions-App",
      "name": "Cryptocurrency Transaction Application"
    },
    {
      "description": "Worked with a team to develop a full stack application for a restaurant. The application permits users to view menus, reserve a seat and contact the restaurant. Users can login to place an order and view previous orders, while admin can view and manage all orders, reservations and menus available. Designed and developed the responsive web application using HTML5, CSS and JavaScript/NodeJS, ReactJS and MongoDB. Developed the frontend features such as reservation page, menu, orders, contact us along with backend features to develop REST API. Worked with Git to push, track and commit code changes to remote repositories.",
      "git_url": null,
      "name": "Falcon Restaurant Web Application"
    },
    {
      "description": "Developed an application using Spring Boot Framework. The website enables users to view available flights by the location and date searched, users can also book a flight. An admin feature is developed to manage flights available, view booked flights and customers. The application was built using Java and implemented Spring Security with Thymeleaf, HTML5 and CSS for the frontend development. Implemented Swagger to provide a visual display of the API documentation.",
      "git_url": "https://github.com/Oreoluwatemi/FlightManagement",
      "name": "Flight Management Web Application"
    },
    {
      "description": "Collaborated with a team to create a mobile app for Android that easily and efficiently enables users to find local food services nearby. Coordinated application plans with development teams and designed prototypes. Created app documentation which provided all pertinent information including features, capabilities and benefits. The app was developed using Android Studio as the IDE, Java, Firebase as the database and XML.",
      "git_url": "https://github.com/Oreoluwatemi/Tiffin-MobileApp",
      "name": "Tiffin Mobile App"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a Linux monitoring agent to gather a server hardware specifications and resource usage data and store the data in a database. Designed the application to permit an Administrator to have a knowledge of a Linux server hardware and keep track of ongoing Linux server resource usage data. Utilized bash scripts which is executed continuously with Crontab to collect usage data and store the data in the PostgreSQL instance in the docker container.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": "To have an in-depth understanding of relational databases, RDMS, SQL, Data models and optimizations, I familiarized myself with hands-on work on a dataset. Implemented DBeaver as the SQL client to perform several DDL and DML operations. Used several technologies such as Docker to manage the PSQL instance, PostgreSQL database to store the data, and Git \u0026 GitHub to manage and track source code.",
      "git_url": "/sql",
      "name": "Database Manipulation"
    },
    {
      "description": [
        "JDBC App: Programmed a JDBC application that connects Java to a PostgreSQL RDBMS database. Implemented DAO design pattern to perform CRUD operations on the database running on a docker container. Utilized Maven to manage the application packages and dependencies.",
        "Grep App: Developed the application using Java 8 which simulates the grep command line function. The functionality to recursively search files with a pattern provided and output the matched lines to a text file was implemented. Utilized BufferedReader, FileReader, BufferedWriter and FileWriter to read and write into files. The application was packaged using Docker and uploaded to Docker Hub, and Maven was utilized to manage dependencies and build the app."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Oreoluwa Lawal",
  "others": [
    {
      "bullets": [
        "Travelling and Exploring",
        "Reading Books: I enjoy Ted Dekker novels.",
        "Volunteer, Salvation Army: Assists in feeding community members weekly."
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Built and tested several applications with technologies such as Java, Linux, and Docker. Collaborated with team members using Agile methodology. Utilized Git and Git Flow for every project. Participated in daily scrum meetings and master code reviews with senior developers.",
      "duration": "2023-present",
      "title": "Software Developer"
    },
    {
      "company": "PersonalBanker Canada",
      "description": "Designed, developed and modified 15+ custom components and features as defined and scoped by the product team. Worked with Git to push, track and commit code changes to remote repositories. Planned, tracked and managed deliverables on 2 deployments to the cloud using Digital Ocean. Worked with Figma to design and prototype the user interface for testing and collaboration. Developed and maintained 10+ REST APIs, writing documentation according to specified requirements.",
      "duration": "2022",
      "title": "Full Stack Developer"
    }
  ],
  "skills": {
    "competent": [
      "React",
      "Docker",
      "Bootstrap",
      "MongoDB",
      "AdobeXD"
    ],
    "familiar": [
      "Figma",
      "SCSS",
      "Android Application Development",
      "C#",
      "Firebase",
      "Swift",
      "Spring Boot",
      "GCP"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git",
      "HTML5",
      "CSS3",
      "Node+Express",
      "JavaScript"
    ]
  },
  "summary": "I am a FullStack developer with a Post Graduate Degree in Information Technology Solutions from Humber College. I have worked on a variety of projects throughout my academic and professional career, specializing in web applications. I am skilled in a variety of development frameworks, such as ReactJS and NodeJS, and I have expertise with a variety of programming languages, such as Java and JavaScript. As a FullStack developer in my last role, I collaborated with my team and participated in all phases of the software development life cycle, including requirements gathering, development, testing, and deployment process to build an agency dashboard system to permit agencies to manage their agents and clients and keep track of their financial services offered such as tax return and assessment. I am an effective communicator and collaborator, and I have worked seamlessly with cross-functional teams to achieve project goals. I currently work as a Software Developer at Jarvis, where I'm tasked with building and testing applications with technologies such as Java, Linux and Docker. In my spare time, I enjoy reading mystery/thriller novels and learning new things, which has allowed me to stay up-to-date with the latest technological advancements. I believe my passion for software development and my experience make me a good fit for any team. I am looking to challenge myself and am interested in positions where I can implement my creativity to solve problems."
}
