{
  "education": [
    {
      "awards_achievements": [
        "First Class Honors",
        "GPA: 4.51/5.0"
      ],
      "degree": "Bachelor of Engineering",
      "department": "Petroleum Engineering",
      "duration": "2014-2019",
      "school_name": "Covenant university"
    },
    {
      "awards_achievements": [
        "Deans List (2021, 2022): Obtained a cumulative average of 80% or higher",
        "GPA: 3.53/4.0"
      ],
      "degree": "Post Graduate Certificate",
      "department": "Information Technology Solutions",
      "duration": "2021-2022",
      "school_name": "Humber College"
    }
  ],
  "github_repo_root_url": "https://github.com/Jarvis-Consulting-Group/jarvis_data_eng-OreoluwaLawal",
  "highlighted_projects": [
    {
      "description": "Developed an application by which users can send some currency (testnet bitcoin) from one wallet to another via a frontend interface. Utilized BlockCypher API for payment processing, wallet details and querying the blockchain for pending transactions. Applied Sass and Bootstrap to make the application responsive. Implemented QRCode to display user wallet address for easy transactions.",
      "git_url": "https://github.com/Oreoluwatemi/Bitcoin-Testnet-Transactions-App",
      "name": "Cryptocurrency Transaction Application"
    },
    {
      "description": "Worked with a team to develop a full stack restaurant application for Falcon restaurant which displays all the restaurant services, it permits for users to view menus, reserve a seat and contact the restaurant. Users can login to place an order and view previous orders, while admin can view and manage all orders, reservations and menus available. Designed and developed the responsive web application using HTML5, CSS and JavaScript/NodeJS, ReactJS and MongoDB. Developed the frontend features such as reservation page, menu, orders, contact us along with backend features to develop REST API. Worked with Git to push, track and commit code changes to remote repositories.",
      "git_url": null,
      "name": "Falcon Restaurant Web Application"
    },
    {
      "description": "Developed an application using Spring Boot Framework. The website enables users to view available flights by the location and date searched, users can also book a flight. An admin feature is developed to manage flights available, view booked flights and customers. The application was built using Java and implemented spring security with Thymeleaf, HTML5 and CSS for the frontend development. Implemented Swagger to provide a visual display of the API documentation.",
      "git_url": "https://github.com/Oreoluwatemi/FlightManagement",
      "name": "Flight Management Web Application"
    },
    {
      "description": "Collaborated with a team to create a mobile app for Android that easily and efficiently enables users to find local food services nearby. Coordinated application plans with development teams and designed prototypes. Created app documentation which provided all pertinent information including features, capabilities and benefits. The app was developed using Android Studio as the IDE, Java, Firebase as the database and XML.",
      "git_url": "https://github.com/Oreoluwatemi/Tiffin-MobileApp",
      "name": "Tiffin Mobile App"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a Linux monitoring agent to gather a server hardware specifications and resource usage data and store the data in a database. Designed the application to permit an Administrator to have a knowledge of a Linux server hardware and keep track of ongoing Linux server resource usage data. Utilized bash scripts which is executed continuously with crontab command to collect usage data and store the data in the PostgreSQL instance in the docker container.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": "To have an in-depth understanding of relational databases, RDMS, SQL, ERD, Data models and optimizations, I familiarized myself with these concepts in SQL with hands-on work on a dataset. Implemented DBeaver as the SQL client to perform several DDL and DML operations. Used several technologies such as Docker to manage the PSQL instance, PostgreSQL database to store the data, and Git \u0026 GitHub to manage and track source code.",
      "git_url": "/sql",
      "name": "Database Manipulation"
    },
    {
      "description": [
        "Twitter App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "JDBC App: Developed a JDBC application that connects Java to a PostgreSQL RDBMS database. Implemented DAO design pattern to permit the Data Access Objects to implement the methods to perform CRUD operations on the database running on a docker container. Utilized Maven to manage the application packages and dependencies.",
        "Grep App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Oreoluwa Lawal",
  "others": [
    {
      "bullets": [
        "Volunteer, Salvation Army: Assists in feeding community members weekly."
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Collaborated with agile/scrum team to work on several projects with technologies such as Java, Linux, Docker. Participated in daily scrum meetings and master code reviews with senior developers.",
      "duration": "2023-present",
      "title": "Software Developer"
    },
    {
      "company": "PersonalBanker Canada",
      "description": "Designed, developed and modified 15+ custom components and features as defined and scoped by the product team. Worked with Git to push, track and commit code changes to remote repositories. Planned, tracked and managed deliverables on 2 deployments to the cloud using Digital Ocean. Worked with Figma to design and prototype the user interface for testing and collaboration. Developed and maintained 10+ REST APIs, writing documentation according to specified requirements.",
      "duration": "2022",
      "title": "Full Stack Developer"
    }
  ],
  "skills": {
    "competent": [
      "NodeJs",
      "ExpressJs",
      "JavaScript",
      "React",
      "Docker",
      "Linux",
      "Bootstrap"
    ],
    "familiar": [
      "TypeScript",
      "SCSS",
      "Mobile App Development(Android and iOS)",
      "C#",
      "Swift",
      "Springboot framework"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git",
      "HTML5",
      "CSS3"
    ]
  },
  "summary": "I am a graduate of Humber College with a Post Graduate Degree in Information Technology Solutions. During my program, I worked on several projects as a group and individually with several tech stacks. I had the opportunity to work with a financial services company as a full stack developer focused on MERN stack technologies and collaborated with team members to build a SaaS software. I was responsible for writing several Rest APIs and implementing APIs on the front-end. From my experience, I have demonstrated problem-solving skills and implemented optimized solutions to challenges. I am a Developer at Jarvis where i'm tasked on challenging projects to improve my skills and broaden my knowledge. In my spare time, I like to read books and learn new things. I am looking to challenge myself and interested in positions where I can implement my creativity to solve problems."
}
